import * as React from 'react';
import Typography, { TypographyProps } from '@material-ui/core/Typography';

interface Props {
  variant?: TypographyProps['variant'];
}

export default function Jugem({ variant = 'body1' }: Props) {
  return (
    <>
      <Typography variant={variant}>
        食う寝る処に住む処、海砂利水魚の、やぶら小路の藪柑子。寿限無、寿限無、パイポパイポ
        パイポのシューリンガン、寿限無、寿限無。パイポパイポ
        パイポのシューリンガン、五劫の擦り切れ、シューリンガンのグーリンダイ、食う寝る処に住む処。グーリンダイのポンポコピーのポンポコナーの。やぶら小路の藪柑子。長久命の長助、水行末
        雲来末 風来末。シューリンガンのグーリンダイ、水行末 雲来末
        風来末、海砂利水魚の。グーリンダイのポンポコピーのポンポコナーの、長久命の長助。
      </Typography>
      <Typography variant={variant}>
        海砂利水魚の。やぶら小路の藪柑子。水行末 雲来末 風来末。水行末 雲来末 風来末、食う寝る処に住む処、パイポパイポ
        パイポのシューリンガン。寿限無、寿限無。シューリンガンのグーリンダイ、食う寝る処に住む処、海砂利水魚の。寿限無、寿限無。グーリンダイのポンポコピーのポンポコナーの。長久命の長助、グーリンダイのポンポコピーのポンポコナーの、パイポパイポ
        パイポのシューリンガン、五劫の擦り切れ。長久命の長助。シューリンガンのグーリンダイ、五劫の擦り切れ。やぶら小路の藪柑子。
      </Typography>
      <Typography variant={variant}>
        やぶら小路の藪柑子。寿限無、寿限無。長久命の長助。海砂利水魚の。長久命の長助、食う寝る処に住む処。水行末 雲来末
        風来末、海砂利水魚の。
      </Typography>
      <Typography variant={variant}>
        パイポパイポ パイポのシューリンガン。食う寝る処に住む処。水行末 雲来末 風来末、海砂利水魚の、パイポパイポ
        パイポのシューリンガン。やぶら小路の藪柑子。シューリンガンのグーリンダイ。海砂利水魚の。グーリンダイのポンポコピーのポンポコナーの、食う寝る処に住む処。寿限無、寿限無、やぶら小路の藪柑子、長久命の長助、グーリンダイのポンポコピーのポンポコナーの。
      </Typography>
      <Typography variant={variant}>
        長久命の長助。寿限無、寿限無、パイポパイポ パイポのシューリンガン。食う寝る処に住む処、水行末 雲来末
        風来末、やぶら小路の藪柑子。グーリンダイのポンポコピーのポンポコナーの、寿限無、寿限無。食う寝る処に住む処。シューリンガンのグーリンダイ。海砂利水魚の。やぶら小路の藪柑子。五劫の擦り切れ。
      </Typography>
      <Typography variant={variant}>
        グーリンダイのポンポコピーのポンポコナーの、長久命の長助。食う寝る処に住む処。食う寝る処に住む処、パイポパイポ
        パイポのシューリンガン、海砂利水魚の。寿限無、寿限無。シューリンガンのグーリンダイ。水行末 雲来末
        風来末。寿限無、寿限無。五劫の擦り切れ。やぶら小路の藪柑子、グーリンダイのポンポコピーのポンポコナーの。パイポパイポ
        パイポのシューリンガン。シューリンガンのグーリンダイ、水行末 雲来末
        風来末。やぶら小路の藪柑子。海砂利水魚の。五劫の擦り切れ。長久命の長助。
      </Typography>
      <Typography variant={variant}>
        やぶら小路の藪柑子、海砂利水魚の、シューリンガンのグーリンダイ。グーリンダイのポンポコピーのポンポコナーの、パイポパイポ
        パイポのシューリンガン。シューリンガンのグーリンダイ。食う寝る処に住む処。グーリンダイのポンポコピーのポンポコナーの。長久命の長助。パイポパイポ
        パイポのシューリンガン、長久命の長助、寿限無、寿限無、やぶら小路の藪柑子。寿限無、寿限無。五劫の擦り切れ、食う寝る処に住む処。五劫の擦り切れ、海砂利水魚の、水行末
        雲来末 風来末。水行末 雲来末 風来末。
      </Typography>
      <Typography variant={variant}>
        やぶら小路の藪柑子、パイポパイポ
        パイポのシューリンガン、シューリンガンのグーリンダイ。海砂利水魚の、五劫の擦り切れ。やぶら小路の藪柑子、グーリンダイのポンポコピーのポンポコナーの。寿限無、寿限無。グーリンダイのポンポコピーのポンポコナーの。
      </Typography>
      <Typography variant={variant}>
        寿限無、寿限無。水行末 雲来末 風来末、海砂利水魚の、パイポパイポ
        パイポのシューリンガン。やぶら小路の藪柑子、長久命の長助。グーリンダイのポンポコピーのポンポコナーの、食う寝る処に住む処。五劫の擦り切れ、寿限無、寿限無。やぶら小路の藪柑子、シューリンガンのグーリンダイ、長久命の長助。
      </Typography>
      <Typography variant={variant}>
        海砂利水魚の。五劫の擦り切れ、パイポパイポ
        パイポのシューリンガン。長久命の長助、グーリンダイのポンポコピーのポンポコナーの。長久命の長助、シューリンガンのグーリンダイ。やぶら小路の藪柑子、海砂利水魚の。食う寝る処に住む処。パイポパイポ
        パイポのシューリンガン。五劫の擦り切れ。水行末 雲来末 風来末、寿限無、寿限無。
      </Typography>
    </>
  );
}
